---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.BuiltInFailures.KeynoteFailures
source: html/3b301ff6-82db-ca35-3c4a-1fd7aea4ae07.htm
---
# BuiltInFailures.KeynoteFailures Members

Provides a container of all Revit built-in FailureDefinitionId instances.